# Используем официальный образ Golang как базовый образ
FROM golang:latest

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /../notes

# Копируем файлы go.mod и go.sum
COPY go.mod go.sum ./

# Загружаем зависимости перед копированием остальных файлов
RUN go mod download

# Копируем остальные файлы приложения внутрь контейнера
COPY . .

# Изменяем права доступа к файлу конфигурации
RUN chmod 777 /notes/config/config.yml

WORKDIR /notes/cmd/notes

# Собираем приложение
RUN go build -o myapp .

# Указываем порт, который будет использоваться приложением
EXPOSE 8080

# Команда для запуска приложения при старте контейнера
CMD ["./myapp"]
